
# Assignment 1 -- SQL 1
## Due September 7, 2017, by 11:45 PM.

The goal of this assignment is to write several SQL queries that will answer questions about a set of surgical cases. 
The data is based on the Anaesthetic Shoulder Arthroscopy Cases (ASAC) Dataset from David Cumin. I have made some minor modificiations to the data, so be sure to use the version of the data available on the course Canvas site. If you are interested, you can learn more about the dataset at https://researchspace.auckland.ac.nz/handle/2292/5378. 

There are 6 tables:

1. AN_CASE(ID, LASTNAME, FIRSTNAME, WEIGHT, HEIGHT, SEX, DOB, ASA, OPDATE, PROC) 

2. AN_COMORBID(ID, ICD, DESCR, DETAILS) 

3. AN_DRUGCATEGORY(DRNAME, DRCAT)

4. AN_DRUG(ID, DRNAME, DRTIME, DRVALUE, DRUNIT, DRROUTE, DRCOMMENT)

5. AN_EVENT(ID, EVENTTIME, EVENTDESC)

6. AN_VITALS(ID, SIGNALTIME, SIGNALNAME, VALUE)


1. AN_CASE contains an entry for each surgical case. It includes the patient's name, gender, height and weight. The ASA is the American Society of Anesthesiologist physical status classification, and reflects the patient's ability to tolerate the surgery. DOB is the patient's date of birth and OPDATE is the date the operation happened. PROC describes the procedures performed.

2. AN_COMORBID contains a list of patient conditions, such as smoking or asthma. Patients can have different numbers of comborbidities. Comorbidities are described using an ICD code (ICD-10-CM Diagnosis Code) and a text description. Some conditions include additional information in the DETAILS field.

3. AN_DRUGCATEGORY contains a list of different medications used during the surgical cases and their categories.

4. AN_DRUG contains a list of medications administered during each surgical case along with the details of the administration (dose, time, method, etc.).

5. AN_EVENT contains key events during the surgical case.  Each row includes the case id, time the event occurred and description of the event.

6. AN_VITALS contains the vital sign data (heart rate, systolic and diastolic blood pressure) collected during each case.

### What to turn in
You must turn in your Jupyter Notebook on Canvas.

### Grading
Each query is worth 10 points. Points will be assigned for each query based on the following guidelines:
* 0 points: Query not attempted, query does not give any results, or it does not compile
* 5 points: Query compiles, runs and is most of the way towards a correct answer
* 8 points: The query and answer it produces are almost correct, but there is a slight or subtle bug in the query
* 10 points: The query is correct and gives the right answer

### What's In and Out of Scope

This is intended to be a SQL query assignment. Therefore, you must write queries in SQL (not stored procedures or functions or python code). You may use VIEWs as needed and you may use standard built-in MySQL functions (e.g. ROUND, IF or CASE statements). If you're not sure if something is allowed, ask!

## Acadmic Honesty
The following level of collaboration is allowed on this assignment: You may discuss the assignment with your classmates at a high level. Any issues getting Jupyter Notebooks or MySQL running is totally fine. What is not allowed is direct examination of anyone else's SQL code (on a computer, email, whiteboard, etc.) or allowing anyone else to see your SQL code.  You MAY post and discuss query results with your classmates.

You may use the search engine of your choice to lookup the syntax for SQL commands, but may not use it to find answers to queries.

It does not matter whether or not you show the output of each code block.
Submit your resulting .ipynb file on Canvas.

First, the standard preliminary steps.  For security reasons, don't include your ricedb password.

To run the code, click on it, and press SHIFT+ENTER.

In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://ricedb:0909@localhost/ricedb

C:\Users\D\Anaconda3\lib\site-packages\pymysql\cursors.py:166: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB2\\xBF\\xCF\\xC4...' for column 'VARIABLE_VALUE' at row 480")
  result = self._query(query)

'Connected: ricedb@ricedb'

## Preparation

Start fresh, if you need to recreate the tables.

In [ ]:
%%sql
DROP TABLE IF EXISTS an_case;
DROP TABLE IF EXISTS an_vitals;
DROP TABLE IF EXISTS an_comorbid;
DROP TABLE IF EXISTS an_event;
DROP TABLE IF EXISTS an_drug;
DROP TABLE IF EXISTS an_drugCategory;

Create the tables you will need for this assignment by excuting the following code:

In [ ]:
%%sql
CREATE TABLE an_case (
    id INTEGER,
    lastName varchar(50),
    firstName varchar(50),
    weight FLOAT null,
    height FLOAT null,
    sex CHAR(1),
    dob DATE,
    asa INTEGER,
    ebl INTEGER,
    opDate DATE,
    proc VARCHAR(110)
);

CREATE TABLE an_vitals (
    id INTEGER,
    signaltime INTEGER,
    signalname CHAR(3),
    value FLOAT
);

CREATE TABLE an_comorbid (
    id INTEGER,
    icd VARCHAR(10),
    descr VARCHAR(100),
    details VARCHAR(100)
);


CREATE TABLE an_event (
    id INTEGER,
    eventtime INTEGER,
    eventdescr VARCHAR(100)
);

CREATE TABLE an_drug (
    id INTEGER,
    drname VARCHAR(25),
    drtime INTEGER,
    drvalue FLOAT, 
    drunit VARCHAR(10),
    drroute VARCHAR(50),
    drcomment VARCHAR(100)
);

CREATE TABLE an_drugCategory (
    drname VARCHAR(25),
    drcat VARCHAR(25)
);

Now load the data needed for the assignment. You have to do this in MySQL Workbench. The files are located on the class Canvas site in https://canvas.rice.edu/courses/3600/files/folder/HW1. 

1. Download the files to your computer
2. Update the statements below to point to your file location
3. Execute the statements in MySQL Workbench

LOAD DATA LOCAL INFILE '[your file location]/an_case.txt' 
INTO TABLE an_case fields terminated by '\t' escaped by '\\\\' 
OPTIONALLY ENCLOSED BY '"' lines terminated by '\r\n' IGNORE 1 LINES;

LOAD DATA LOCAL INFILE '[your file location]/an_vitals.txt' 
INTO TABLE an_vitals fields terminated by '\t' escaped by '\\\\' 
OPTIONALLY ENCLOSED BY '"' lines terminated by '\r\n' IGNORE 1 LINES;

LOAD DATA LOCAL INFILE '[your file location]/an_comorbid.txt' 
INTO TABLE an_comorbid fields terminated by '\t' escaped by '\\\\' 
OPTIONALLY ENCLOSED BY '"' lines terminated by '\r\n' IGNORE 1 LINES;

LOAD DATA LOCAL INFILE '[your file location]/an_event.txt' 
INTO TABLE an_event fields terminated by '\t' escaped by '\\\\' 
OPTIONALLY ENCLOSED BY '"' lines terminated by '\r\n' IGNORE 1 LINES;

LOAD DATA LOCAL INFILE '[your file location]/an_drug.txt' 
INTO TABLE an_drug fields terminated by '\t' escaped by '\\\\' 
OPTIONALLY ENCLOSED BY '"' lines terminated by '\r\n' IGNORE 1 LINES;

LOAD DATA LOCAL INFILE '[your file location]/an_drugCategory.txt'
INTO TABLE an_drugCategory fields terminated by '\t' escaped by '\\\\' 
OPTIONALLY ENCLOSED BY '"' lines terminated by '\r\n' IGNORE 1 LINES;

If you accidentally load the data more than once, or run into some other problem, you can rerun these steps after dropping the tables and recreating and loading them as described above.

## Queries
Answer all of the questions below by writing and executing SQL queries. The queries must contain ONLY the answer to the question (no extra rows or columns). You many only use SQL to answer the questions. You may need to explore the database a bit prior to generating your final solutions. You can limit the number of records returned from a query by using the ending term "LIMIT N", where N is the number of records to turn.  

For example, "SELECT * FROM AN_VITALS LIMIT 100;" returns the 100 records from the AN_VITALS table.

### Query 1 

How many patients are male?

In [6]:
%%sql
#How many patients are male?
SELECT COUNT(id) 
FROM an_case 
WHERE sex = 'M';

1 rows affected.

[(13,)]

### Query 2

What are the names of the different signals recorded in the vitals table (in alphabetical order)?

In [7]:
%%sql
#What are the names of the different signals recorded in the vitals table (in alphabetical order)?
SELECT DISTINCT signalname
FROM an_vitals
ORDER BY signalname;

3 rows affected.

[('DBP',), ('HR',), ('SBP',)]

### Query 3 

How old was each patient at the time of the operation? (show id and age in years). Sort in order by age from youngest to oldest.

In [8]:
%%sql
#How old was each patient at the time of the operation? (show id and age in years). 
#Sort in order by age from youngest to oldest.
SELECT id, TIMESTAMPDIFF(YEAR, dob, opDate) AS age
FROM an_case
ORDER BY age;

20 rows affected.

[(16, 21),
 (10, 23),
 (17, 23),
 (4, 30),
 (1, 31),
 (5, 35),
 (6, 37),
 (13, 37),
 (14, 40),
 (2, 42),
 (12, 45),
 (8, 46),
 (18, 50),
 (19, 50),
 (9, 53),
 (15, 57),
 (11, 60),
 (7, 63),
 (20, 67),
 (3, 70)]

### Query 4

Which patients are either smokers or have allergies? Use a UNION operator in this query. List the relevant patient ids, first and last names in order by last then first name.

In [9]:
%%sql
#Which patients are either smokers or have allergies? Use a UNION operator in this query. 
#List the relevant patient ids, first and last names in order by last then first name.
SELECT A.id, A.lastName, A.firstName
FROM an_case A
INNER JOIN an_comorbid B ON A.id = B.id
WHERE B.descr = 'smoker'
UNION
SELECT A.id, A.lastName, A.firstName
FROM an_case A
INNER JOIN an_comorbid B ON A.id = B.id
WHERE B.descr = 'allergy'
ORDER BY lastName, firstName;

10 rows affected.

[(2, 'Baker', 'Kayla'),
 (12, 'Gomez', 'Teresa'),
 (9, 'Hernandez', 'Tomas'),
 (20, 'Jones', 'Jose'),
 (4, 'Little', 'Tyler'),
 (3, 'Perez', 'Judy'),
 (14, 'Peterson', 'Dante'),
 (8, 'Walker', 'Christine'),
 (13, 'Ward', 'Sophia'),
 (10, 'Young', 'David')]

### Query 5

Which woman's highest systolic blood pressure was over 170? Show her first and last name.

In [10]:
%%sql
#Which woman's highest systolic blood pressure was over 170? 
#Show her first and last name.
SELECT DISTINCT A.firstName, A.lastName
FROM an_case A
INNER JOIN an_vitals B ON A.id = B.id
WHERE sex = 'F' AND signalname = 'SBP' AND value > 170;

1 rows affected.

[('Judy', 'Perez')]

### Query 6

The function TIMESTAMPDIFF(unit,startingDatetime,endingDatetime) can be used to calculate elapsed time in different units. You may use this function to help answer this question.

Which patients who are at least 40 years old at the time of surgery, had a max SBP < 120? 
Show lastname, firstname, max SBP

In [21]:
%%sql
#Which patients who are at least 40 years old at the time of surgery, had a max SBP < 120? 
#Show lastname, firstname, max SBP
SELECT lastName, firstName, MAX(value) AS 'max SBP'
FROM an_case A
INNER JOIN an_vitals B ON A.id = B.id
WHERE signalname = 'SBP' AND TIMESTAMPDIFF(YEAR, dob, opDate) >= 40
GROUP BY lastName, firstName
HAVING MAX(value) < 120;

2 rows affected.

[('Jones', 'Jose', 105.0), ('Peterson', 'Dante', 117.0)]

### Query 7

What is the average number of comorbidities? (to two decimal places)

In [12]:
%%sql
#What is the average number of comorbidities? (to two decimal places)
#Assumption: assume the number of comorbidities of the patients who are not listed in table an_comorbid is 0.
SELECT ROUND(COUNT(*) / (
    SELECT COUNT(DISTINCT id)
    FROM an_case
), 2) AS averageComorbid
FROM an_comorbid;

1 rows affected.

[(Decimal('1.05'),)]

### Query 8

What are the 3 most frequent comorbidity ICD codes? Show the ICD code, description and the number of occurrences.
List in descending order by frequency.

In [5]:
%%sql
#What are the 3 most frequent comorbidity ICD codes? 
#Show the ICD code, description and the number of occurrences. List in descending order by frequency.
SELECT icd, descr, COUNT(*) AS frequency
FROM an_comorbid
GROUP BY icd, descr
ORDER BY frequency DESC
LIMIT 3;

3 rows affected.

[('Z72.0', 'Smoker', 5), ('J45.9', 'Asthma', 4), ('Z88.6', 'Allergy', 3)]

### Query 9

What is the eventdescr value for the last event for Patient 3?

In [14]:
%%sql
#What is the eventdescr value for the last event for Patient 3?
SELECT eventdescr
FROM an_event
WHERE id = 3
ORDER BY eventtime DESC
LIMIT 1;

1 rows affected.

[('Extubation',)]

### Query 10

Which patient(s) do not have a "knife to skin" event? List id(s) in numerical order. Do not repeat Ids.

In [15]:
%%sql
#Which patient(s) do not have a "knife to skin" event? 
#List id(s) in numerical order. Do not repeat Ids.
SELECT DISTINCT id
FROM an_event
WHERE id NOT IN (
    SELECT id
    FROM an_event
    WHERE eventdescr = 'knife to skin'
)
ORDER BY id;

2 rows affected.

[(14,), (19,)]

### Query 11

How long was each patients' surgery (in minutes)?
Round to the nearest minute using the SQL ROUND command. List the case id and the number of minutes, in order from shortest to longest, then by id.

In [16]:
%%sql
#How long was each patients' surgery (in minutes)? 
#Round to the nearest minute using the SQL ROUND command. 
#List the case id and the number of minutes, in order from shortest to longest, then by id.
SELECT id, ROUND((MAX(eventtime) - MIN(eventtime))/60) AS surgicalTime
FROM an_event
GROUP BY id
ORDER BY surgicalTime, id;

20 rows affected.

[(14, Decimal('46')),
 (18, Decimal('53')),
 (2, Decimal('54')),
 (5, Decimal('61')),
 (15, Decimal('75')),
 (9, Decimal('90')),
 (19, Decimal('90')),
 (12, Decimal('97')),
 (20, Decimal('98')),
 (11, Decimal('117')),
 (7, Decimal('118')),
 (1, Decimal('128')),
 (4, Decimal('129')),
 (8, Decimal('137')),
 (16, Decimal('140')),
 (17, Decimal('140')),
 (10, Decimal('144')),
 (6, Decimal('148')),
 (3, Decimal('195')),
 (13, Decimal('209'))]

### Query 12
Which case had the longest surgical time? (Knife to skin to Surgery / operation over events). Give the case id.

In [12]:
%%sql
#Which case had the longest surgical time? (Knife to skin to Surgery / operation over events). 
#Give the case id.
SELECT id
FROM an_event
WHERE eventdescr = 'Knife to skin' 
    OR eventdescr = 'Surgery start' 
    OR eventdescr = 'Surgery over'
    OR eventdescr = 'Surgery finished'
    OR eventdescr = 'Surgery complete'
    OR eventdescr = 'Operation over'
    OR eventdescr = 'Sugery over'
GROUP BY id
ORDER BY (MAX(eventtime) - MIN(eventtime)) DESC
LIMIT 1;

1 rows affected.

[(13,)]

### Query 13
How long was the case? (Knife to skin to Surgery / operation over events). Give the answer in whole minutes.

In [4]:
%%sql
#How long was the case? (Knife to skin to Surgery / operation over events). 
#Give the answer in whole minutes.
SELECT ROUND((MAX(eventtime) - MIN(eventtime))/60) AS surgicalTime
FROM an_event
WHERE eventdescr = 'Knife to skin' 
    OR eventdescr = 'Surgery start' 
    OR eventdescr = 'Surgery over'
    OR eventdescr = 'Surgery finished'
    OR eventdescr = 'Surgery complete'
    OR eventdescr = 'Operation over'
    OR eventdescr = 'Sugery over'
GROUP BY id
ORDER BY surgicalTime DESC
LIMIT 1;

1 rows affected.

[(Decimal('158'),)]

### Query 14
The hospital wants to reduce it's inventory. So, it wants to review drugs that are used infrequently.

Find all the named drugs (from the drugs table or from the drug category table) used in less than 2 cases. List the drug name and the number of cases it was used in. Sort by drug name.

In [17]:
%%sql
#Find all the named drugs (from the drugs table or from the drug category table) used in less than 2 cases.
#List the drug name and the number of cases it was used in. Sort by drug name.
SELECT b.drname, COUNT(DISTINCT a.id) AS drFrequency
FROM an_drug a
RIGHT JOIN an_drugcategory b ON a.drname = b.drname
GROUP BY b.drname
HAVING drFrequency < 2
ORDER BY b.drname;

11 rows affected.

[('Atracurium', 1),
 ('Augmentin', 1),
 ('Bupivicane', 1),
 ('Clonidine', 1),
 ('Halothane', 0),
 ('Lignocaine', 1),
 ('Morphine', 1),
 ('Remifentynal', 1),
 ('Rocuronium', 0),
 ('Tetracaine', 0),
 ('Tranexamic Acid', 1)]

### Query 15
The hospital wants to identify patients who might have complications. 
One way to do this is to use to do this is to use the Surgical Apgar score (http://www.atulgawande.com/documents/AnApgarScoreforSurgery.pdf). 

The score uses estimated blood loss (the EBL column in our case table), the patient's minimum mean blood pressure (they want arterial, but our noninvasive measure will suffice), and lowest heart rate.

|                   | 0 points | 1 point   | 2 points | 3 points | 4 points |
|-------------------|----------|-----------|----------|----------|----------|
| EBL               |  > 1,000 | 601-1,000 |  101-600 |  <= 100  |     -    |
| Lowest Mean BP    |   < 40   |   40-54   |   55-69  |   >=70   |     -    |
| Lowest Heart Rate |   > 85   |   76-85   |   66-75  |   56-65  |   <= 55  |

Mean Blood Pressure = $\frac{SBP + 2 * DBP}{3}$. It weights the diastolic blood pressure twice as much as the systolic. Note that valid (non-artifact) values for DBP are > 20 and SBP > 40.

Show the case id, EBL points, BP points, HR points and the final Surgical Apgar Score for each case. Sort in order by id. 

Your SQL code MUST handle all possible ranges of values.

In [20]:
%%sql
#Show the case id, EBL points, BP points, HR points and the final Surgical Apgar Score for each case. 
#Sort in order by id.
#Assumption: In medicine, thresholds really matter. If a patient's BP is, say 55 or above, then 54.9999 is still below 55.
    #When we see a value (N) with a non-equality comparison operator, assume that the value is really N.99999 with the 9's repeating forever. 
    #So the Lowest Mean BP range for 1 point is 40.0 anything thru 54.99999... 2 points starts at 55.0 and so on.

SELECT A.id, `EBL points`, `BP points`, `HR points`, `EBL points` + `BP points` + `HR points` AS 'Surgical Apgar Score'
FROM (
    SELECT id, 
        CASE
            WHEN ebl > 1000 THEN 0
            WHEN ebl >= 601 AND ebl <= 1000 THEN 1
            WHEN ebl >= 101 AND ebl < 601 THEN 2
            WHEN ebl < 101 THEN 3
            ELSE 0
        END AS 'EBL points'
    FROM an_case
) A
INNER JOIN (
    SELECT B.id,  
        CASE
            WHEN ((minSBP + 2 * minDBP) / 3) < 40 THEN 0
            WHEN ((minSBP + 2 * minDBP) / 3) >= 40 AND ((minSBP + 2 * minDBP) / 3) < 55 THEN 1
            WHEN ((minSBP + 2 * minDBP) / 3) >= 55 AND ((minSBP + 2 * minDBP) / 3) < 70 THEN 2
            WHEN ((minSBP + 2 * minDBP) / 3) >=70 THEN 3
            ELSE 0
        END AS 'BP points'
    FROM ((
        SELECT id, MIN(value) AS minSBP
        FROM an_vitals
        WHERE signalname = 'SBP' AND value > 40
        GROUP BY id
        ) B
        INNER JOIN (
            SELECT id, MIN(value) AS minDBP
            FROM an_vitals
            WHERE signalname = 'DBP' AND value > 20
            GROUP BY id
        ) C ON B.id = C.id
    )
) D ON A.id = D.id
INNER JOIN (
    SELECT id,  
        CASE
            WHEN MIN(value) > 85 THEN 0
            WHEN MIN(value) >= 76 AND MIN(value) <= 85 THEN 1
            WHEN MIN(value) >= 66 AND MIN(value) < 76 THEN 2
            WHEN MIN(value) >= 56 AND MIN(value) < 66 THEN 3
            WHEN MIN(value) < 56 THEN 4
            ELSE 0
        END AS 'HR points'
    FROM an_vitals
    WHERE signalname = 'HR'
    GROUP BY id
) E ON A.id = E.id
ORDER BY id;

20 rows affected.

[(1, 3, 2, 1, 6),
 (2, 3, 1, 2, 6),
 (3, 3, 2, 4, 9),
 (4, 3, 2, 4, 9),
 (5, 3, 2, 4, 9),
 (6, 3, 1, 4, 8),
 (7, 3, 2, 3, 8),
 (8, 3, 1, 4, 8),
 (9, 3, 1, 4, 8),
 (10, 3, 1, 4, 8),
 (11, 2, 2, 4, 8),
 (12, 3, 3, 4, 10),
 (13, 3, 1, 4, 8),
 (14, 3, 2, 4, 9),
 (15, 3, 2, 3, 8),
 (16, 3, 2, 4, 9),
 (17, 3, 3, 4, 10),
 (18, 3, 3, 3, 9),
 (19, 3, 2, 4, 9),
 (20, 3, 2, 4, 9)]

## Short answer questions

These questions will be graded based on the thought and effort put into the answers (yes, I know that's a bit vague). Trivial or very minor answers that don't significantly differ from the existing solution will be given minimal points.  Answers should be reasonable approaches, without resorting to overloading fields, etc.

### Short answer 1
Describe another way of structuring the vital sign data within the database. (5 points) 

What the are advantages and disadvantages? (5 points)

Specifically address storage space and how you can access values for more than one signal at any given time point.

##### Ans:

#### (a)
(1) Since the attribute 'signalname' is highly repetitive in the current an_vitals table, I would like to store the vital sign data in three tables as an_HR, an_SBP, and an_DBP, to store the data for HR sign, SBP sign, and DBP sign respectively. Each table has attributes as 'id', 'signaltime', and 'value'. The total number of entries is the same as the table an_vitals'. But we do not need the attribute 'signalname' in each table.

(2)I think the main advantage of storing data in three tables is that we highly reduce the storage space of these sign data. Each entry of signalname name has a data type of char(3), which need 3*3 (code in utf-8) bytes. As we have more than 28000 rows in an_vitals, the space will be at lest 250 KB less than storing data in one table. Also, by separating them into multiple tables, we can avoid too many rows in a single table which is not performance-optimized.
    
For the disadvantages, it may not be that straightforward to access values for more than one sign at any given time point. Since the data are stored in three different tables, we need to join the tables first or union the data selected from three tables separately. Besides, if we get values of different signals, we need to insert them into the corresponding tables which may not be that convenient as inserting to just one table.

#### (b)
(1) Another way to structure the vital table may be separating the attribute 'value' into three attributes as 'HRvalue', 'SBPvalue', and 'DBPvalue'. Thus, we do not need the attribute 'signalname' as well. Finally the new table has attributes as following: 'id', 'signaltime', 'HRvalue', 'SBPvalue', and 'DBPvalue'.

(2) By structuring like this, we can store and access the values for more than one signal at each given time point in a single row. Ideally, if we have all the three signal values at every given time point, we can reduce the number of the rows by 2/3. Thus, we save 2/3 storage space of the 'id' and 'signaltime' attributes and the whole storage space of the 'signalname' attribute.

But not all signals have value at each given time point. If there is only one signal recorded at each time point, no value will be stored in the attributes for other signals' value, which leads to a waste of space. Through the attribute 'signalname' in the original table is dropped here, not much space is saved in this kind of bad cases.

### Short answer 2
Describe a more compact way to store the BP values. (5 points)

Calculate the savings, based on the following storage requirements:
https://dev.mysql.com/doc/refman/5.7/en/storage-requirements.html#data-types-storage-reqs-numeric
    
You must explain how you got to your space saving answer. (5 points)

##### Ans:

(1) Currently the table an_vitals use FLOAT as the data type to store BP values. The maximum BP value in the table is 175 and the minimum is 0. And the number of decimal places is at most 2. Since the BP value of human will not exceed 300, so we can use SMALLINT as the data type to store BP values instead of FLOAT. We need to tiems all the current values by 100 in order to store they as SMALLINT type. And also need to divid them by 100 when we use them. But SMALLINT does save more space than FLOAT.

(2) Each FLOAT costs 4 bytes and each SMALLINT costs 2 bytes only. As we have 28125 rows in the table an_vitals, the saved space will be approximately (4-2)*28125 = 56250 bytes, which is about 56 KB.

### Short answer 3
Some of the event times are negative numbers. 

Why might this be? (3 points)

What are the implications? (4 points)

What might you choose to do about this? (3 points)

##### Ans:

(1) The event time does not contain date or exact timestamp information. So the it may represent the difference between the time point when event happens and some specific time point (e.g., 12 o'clock midnight everyday). When the event happens before that specific time point, the event time will be a negative number.

(2) We should be careful when deal with data which contain time information. Events may happen before we expect. And INT may not always be a good choice for representing timestamp. It is better to record accurate time and date information as well in some cases.

(3) I may use DATETIME type to store event times if storage space allows. Because it is used for values that contain both date and time parts and its range is larger than TIMESTAMP. Thus, we can record detailed information of the event time and do not need to deal with negative numbers.

## Survey (5 points)
It took me approximately N hours to complete this assignment, where N is:

In [2]:
# Ans:
27

27